course/ModelTheoryReadingGroup/BasicValuationTheory.org
#+title: Basic Valuation Theory

#+AUTHOR: Chen Qi'ao

#+EXPORT_FILE_NAME: ../..//latex/ModelTheoryReadingGroup/BasicValuationTheory.tex
#+LATEX_HEADER: \graphicspath{{../../books/}}
#+LATEX_HEADER: \input{../../preamble.tex}
#+LATEX_HEADER: \makeindex
#+OPTIONS: toc:nil
* COMMENT CheckBox [12/12]
    * [X] absolute value
    * [X] \(p\)-adic numbers and formal series
    * [X] topology
    * [X] completion
    * [X] completions satisfy Hensel's Lemma
    * [X] absolute values are either archimedean or non-archimedean
    * [X] archimedean absolute values are boring
    * [X] valuations are a generalization of non-archimedean absolute values
    * [X] valuations can be understood in terms of valuation rings
    * [X] henselianity
    * [X] henselianity can be characterized in terms of extending valuations
    * [X] henselianity can be characterized in terms of Hensel's Lemma. It's a first-order property
        henselian ring is a first order property


* Absolute Values
