latex/ModelTheoryReadingGroup/BasicValuationTheory.tex
% Created 2023-03-02 Thu 13:03
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\graphicspath{{../../books/}}
\input{../../preamble.tex}
\makeindex
\author{Chen Qi'ao}
\date{\today}
\title{Basic Valuation Theory}
\hypersetup{
 pdfauthor={Chen Qi'ao},
 pdftitle={Basic Valuation Theory},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.92 (Org mode 9.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
