course/ModelTheoryReadingGroup/BasicValuationTheory.org
** Absolute Values - Completions
    Let \(K\) be a field. An *absolute value* on \(K\) is a map
    \begin{equation*}
    \abs{\;}:K\to\R
    \end{equation*}
    satisfying the following axioms for all \(x,y\in K\)
    1. \(\abs{x}>0\) for all \(x\neq 0\), and \(\abs{0}=0\)
    2. \(\abs{xy}=\abs{x}\abs{y}\)
    3. \(\abs{x+y}\le\abs{x}+\abs{y}\)

    The absolute value sending all \(x\neq 0\) to 1 is called the *trivial* absolute value on \(K\).

    Observation: \(\abs{1}^2=\abs{1^2}=\abs{1}\), \(\abs{1}=1=\abs{-1}\), \(\abs{x}=\abs{-x}\) for all
    \(x\in K\), \(\abs{x^{-1}}=\abs{x}^{-1}\) for \(x\neq 0\).

    #+ATTR_LATEX: :options []
    #+BEGIN_proposition
    The set \(\{\abs{n\cdot 1}\mid n\in\Z\}\) is bounded iff \(\abs{\;}\) satisfies the "ultrametric" inequality
    \begin{equation}
    \label{1.2}
    \abs{x+y}\le\max\{\abs{x},\abs{y}\}
    \end{equation}
    for all \(x,y\in K\)
    #+END_proposition

    #+BEGIN_proof
    \(\Leftarrow\): Easy, bounded by 1

    \(\Rightarrow\): let \(\abs{n\cdot 1}\le C\), then
    \begin{equation*}
    \abs{x+y}^n=\abs{(x+y)^n}\le\sum_\nu\abs{\binom{n}{\nu}x^\nu y^{n-\nu}}\le(n+1)C\max(\abs{x},\abs{y})^n
    \end{equation*}
    #+END_proof

    If an absolute value satisfies eqref:1.2, it is called *non-archimedean*; otherwise it is called
    *archimedean*. Clearly, if \(\tchar K\neq 0\), \(K\) cannot carry any archimedean absolute value.

    #+ATTR_LATEX: :options []
    #+BEGIN_examplle
    Let
    \begin{equation*}
    \abs{x}_0=
    \begin{cases}
    x&x\ge 0\\
    -x&x\le 0
    \end{cases}
    \end{equation*}
    for all \(x\in\R\); we call \(\abs{\;}_0\) the *usual* absolute value on \(\R\). This is an
    archimedean absolute value.
    #+END_examplle

    #+ATTR_LATEX: :options []
    #+BEGIN_examplle
    For every prime \(p\), the *\(p\)-adic* absolute value \(\abs{\;}_p\) on \(\Q\) is defined by
    \(\abs{0}_p=0\) and
    \begin{equation*}
    \abs{p^\nu\frac{m}{n}}_p=\frac{1}{e^\nu}
    \end{equation*}
    where \(\nu\in\Z\), and \(n,m\in\Z\setminus\{0\}\) are not divisible
    by \(p\). In this case
    \begin{equation*}
    \{\abs{n\cdot 1}_p\mid n\in\Z\}=\{e^{-\nu}\mid\nu\in\N\}
    \end{equation*}
    is bounded in \(\R\).
    #+END_examplle

    #+ATTR_LATEX: :options []
    #+BEGIN_examplle
    Let \(F\) be a field and let \(F[[T]]=\{\sum_{i=0}^\infty a_iT^i\mid a_i\in F\}\), which is called
    the *formal power series over \(F\)*. We can define the absolute value \(\abs{\;}\) as
    \begin{equation*}
    \abs{f}=e^{-m}
    \end{equation*}
    when \(f=\sum_{i=m}^\infty a_iT^i\) where \(a_m\neq 0\) .
    #+END_examplle

    #+ATTR_LATEX: :options []
    #+BEGIN_examplle
    label:e1.1.4
    We define for every irreducible polynomial \(p\in k[X]\), \(k\) a field, the following absolute
    value \(\abs{\;}_p\) on the rational function field \(K=k(X)\):
    Let \(\abs{0}_p=0\) and
    \begin{equation*}
    \abs{p^\nu\frac{f}{g}}_p=\frac{1}{e^\nu}
    \end{equation*}
    where \(\nu\in\Z\) and \(f,g\in k[X]\setminus\{0\}\) are not divisible by \(p\). Hence the
    set \(\{\abs{n\cdot 1}_p\mid n\in\Z\}\) is bounded in \(\R\).
    #+END_examplle

    #+ATTR_LATEX: :options []
    #+BEGIN_proposition
    If \(A\) is a domain, \(K\) is the fraction field of \(A\) and \(\abs{\;}\) is an absolute
    value, then we can uniquely extend \(\abs{\;}\) to \(K\)
    #+END_proposition

    #+BEGIN_proof
    For any \(a,b\in A\) and \(b\neq 0\),
    \begin{equation*}
    \abs{a}=\abs{b\cdot\frac{a}{b}}=\abs{b}\abs{\frac{a}{b}}
    \end{equation*}
    #+END_proof

    An absolute value \(\abs{\;}\) on \(K\) defines a metric by taking \(\abs{x-y}\) as distance,
    for \(x,y\in K\). In particular, \(\abs{\;}\) induces a topology on \(K\) by taking basic open
    balls \(B_\epsilon(a)=\{x:\abs{x-a}<\epsilon\}\).

    Since a non-trivial absolute value \(\abs{\;}\) defines a metric on \(K\), we may consider the
    completion of \(K\) w.r.t. \(\abs{\;}\). Fix a \(\abs{\;}\).

    A sequence \((x_n)_{n\in\N}\) of elements of \(k\) is called a *Cauchy sequence* if for every \(\epsilon>0\)
    there exists \(N\in\N\) s.t. for all \(n,m>N\) we have
    \begin{equation*}
    \abs{x_n-x_m}<\epsilon
    \end{equation*}
    We say a sequence \((x_n)_{n\in\N}\) *converges* to \(x\in K\)  and write \(\lim_{n\to\infty}x_n=x\) if for
    every \(\epsilon>0\) there is an \(N\in\N\) s.t. for all \(n>N\) we have
    \begin{equation*}
    \abs{x_n-x}<\epsilon
    \end{equation*}
    \(K\) is *complete* if every Cauchy sequence from \(K\) converges to some element of \(K\).

    The next theorem will show that every field \(K\) with a non-trivial absolute value can be densely
    embedded into a field complete with respect to an ab- solute value extending the given one
    on \(K\).

    #+ATTR_LATEX: :options []
    #+BEGIN_theorem
    label:1.1.4
    There exists a field \(\hatK\), complete under an absolute value \(\abs{\hat{\;}}\), and an
    embedding \(\iota:K\to\hatK\), s.t. \(\abs{x}=\abs{\hat{\iota{x}}}\) for all \(x\in K\). The image \(\iota(K)\)
    is dense in \(\hatK\). If \((\hatK',\iota')\) is another such pair, then there exists a unique
    continuous isomorphism \(\varphi:\hatK\to\hatK'\) preserving the absolute value and making  the diagram
    \begin{center}\begin{tikzcd}
    \hatK\ar[rr,"\varphi"]&&\hatK'\\
    &K\ar[ul,"\iota"]\ar[ur,"\iota'"']
    \end{tikzcd}\end{center}
    Such a pair is called a *completion* of the valued field \(K,\abs{\;}\)
    #+END_theorem

    #+BEGIN_proof
    /Sketch of completion/:

    Let \(\calc\) be the set of all Cauchy sequences \((x_n)_{n\in\N}\) of elements of \(K\). \(\calc\) is a
    ring with componentwise addition and multiplication. \(\caln=\{(x_n)_{n\in\N}\mid\lim_{n\to\infty}x_n=0\}\) is
    an ideal of \(\calc\).

    Each \((a_n)_{n\in\N}\in\calc\setminus\caln\) has a positive lower bound, and therefore there is \(M\in\N\) and \(\eta>0\)
    s.t. \(\abs{a_n}>\eta\) for every \(n>M\).

    Setting \(c_n=1\) for every \(n=1,\dots,M\) and \(c_n=a_n^{-1}\) for every \(n>M\).
    Then \((c_n)_{n\in\N}\) is a Cauchy sequence, and \((a_n)_{n\in\N}(c_n)_{n\in\N}-(1)_{n\in\N}\in\caln\). Thus the
    ideal \(\caln\) is a maximal ideal of \(\calc\), and the quotient ring \(\hatK\) is a field.

    The map \(\iota:K\to\hatK\) defined by \(\iota(x)=(x_n)_{n\in\N}+\caln\), where \(x_n=x\) for every \(n\),
    embeds \(K\) in \(\hatK\).

    For \((a_n)_{n\in\N}\in\calc\) the sequence \((\abs{a_n})_{n\in\N}\) is a Cauchy sequence of real numbers,
    since \(\abs{\abs{a_p}-\abs{a_q}}_0\le\abs{a_p-a_q}\) for all \(p,q\). Moreover, for every
    sequence \((a_n)_{n\in\N}\in\caln\) the sequence of real numbers \((\abs{a_n})_{n\in\N}\) has limit 0.
    Consequently for \(\xi=(a_n)_{n\in\N}+\caln\) the value
    \begin{equation*}
    \abs{\hat{\xi}}=\lim_{n\to\infty}\abs{a_n}
    \end{equation*}
    does not depend on the representative \((b_n)_{n\in\N}\) of \xi.And it's an absolute value
    of \(\hatK\) that induces \(\abs{\;}\) on \(K\).
    #+END_proof

    #+ATTR_LATEX: :options []
    #+BEGIN_definition
    Let \(\Q_p\) be the completion of \(\Q\) w.r.t. the \(p\)-adic absolute value \(\abs{\;}_p\),
    called *\(p\)-adic numbers*. The ring of *\(p\)-adic integers* is \(\Z_p=\{x\in\Q_p\mid\abs{x}_p\le 1\}\)
    #+END_definition

    #+ATTR_LATEX: :options []
    #+BEGIN_fact
    1. \(\Z_p\) is the completion of \(\Z\) w.r.t. the \(p\)-adic absolute value.
    2. \(\Q_p=\Z_p[1/p]\).
    3. Every \(x\in\Z_p\) can be written in the form
       \begin{equation*}
       x=b_0+b_1p+b_2p^2+\dots+b_np^n+\dots
       \end{equation*}
       where \(0\le b_i\le p-1\), and this representation is unique.
    4. Every \(x\in\Q_p\) can be written in the form
       \begin{equation*}
       x=\sum_{n\ge-n_0}b_np^n
       \end{equation*}
       where \(0\le b_n\le p-1\) and \(\abs{x}_p=e^{n_0}\). This representation is unique.
    #+END_fact

