latex/ModelTheoryReadingGroup/BasicValuationTheory.tex

\subsection{Archimedean Complete Fields}
\label{sec:org5d32c35}
Let \(K\) be a field complete w.r.t. an archimedean absolute value \(\abs{\;}\). Since the
set \(\{\abs{n\cdot 1}\mid n\in\Z\}\) is not bounded, \(\tchar K=0\). Thus \(K\) contains the field \(\Q\) of
rationals.

\(\abs{\;}\) restricted to \(\Q\) induces the same topology as the usual absolute value of \(\Q\). Thus the
complete field \(K\) contains the completion of \(\Q\) w.r.t. the ordinary absolute value,
i.e., \(K\) contains \(\R\) as a closed subfield.

Then \(K\) must be equal to \(\R\) or to \(\C\). Consequently, every field \(K\) admitting an
archimedean absolute value may be considered as a subfield of \(\C\) or even \(\R\) with the
absolute value dependent on the induced one from \(\C\) (or from \(\R\))

\subsection{Non-Archimedean Complete Fields}
\label{sec:org4a077eb}
Assume \(\abs{\;}\) is a non-trivial, non-archimedean absolute value on the field \(K\), we can
define an ``additive'' presentation of the absolute value \(\abs{\;}\):
\begin{equation*}
v(x):=-\ln\abs{x}
\end{equation*}
In the case of the \(p\)-adic absolute value \(\abs{\;}_q\) on \(\Q\), we obtain
\begin{equation*}
v_p(p^\nu\frac{m}{n})=\nu
\end{equation*}
\(v_p\) is called the \textbf{\(p\)-adic valuation} on \(\Q\).

Using the additive notion, the axioms of a non-archimedean absolute value
\begin{equation*}
v:K\to\R\cup\{\infty\}
\end{equation*}
now reads for all \(x,y\in K\)
\begin{enumerate}
\item \(v(x)\in\R\) for \(x\neq 0\), \(v(0)=\infty\)
\item \(v(xy)=v(x)+v(y)\)
\item \(v(x+y)\ge\min\{v(x),v(y)\}\)
\end{enumerate}

First we note that only the additive structure of \(\R\) together with the ordering on \(\R\) is
used, we will generalize this later. Secondly, \(\infty\) is a symbol that satisfies, for
all \(\gamma\in\R\), the following axiom:
\begin{equation*}
\infty=\infty+\infty=\gamma+\infty=\infty+\gamma
\end{equation*}

By an \textbf{ordered abelian group} we mean an abelian group \((\Gamma,+,0)\) together with a binary
relation \(\le\) on \(\Gamma\), where \(\le\) is a linear order on \(\Gamma\) and for any \(\gamma,\delta,\lambda\in\Gamma\),
\begin{equation*}
\gamma\le\delta\Rightarrow\gamma+\lambda\le\delta+\lambda
\end{equation*}

Let \(\Gamma\) be an ordered abelian group, and \(\infty\) a symbol satisfying for all \(\gamma\in\Gamma\),
\begin{equation*}
\infty=\infty+\infty=\gamma+\infty=\infty+\gamma.
\end{equation*}
We then define a \textbf{valuation} \(v\) on a field \(K\) to be a surjective map
\begin{equation*}
v:K\twoheadrightarrow\Gamma\cup\{\infty\}
\end{equation*}
satisfying the following axioms: for all \(x,y\in K\),
\begin{enumerate}
\item \(v(x)=\infty\Rightarrow x=0\)
\item \(v(xy)=v(x)+v(y)\)
\item \(v(x+y)\ge\min\{v(x),v(y)\}\)
\end{enumerate}

If \(\Gamma=\{0\}\), we call \(v\) the \textbf{trivial valuation}; for all \(x,y\in K\):
\begin{gather*}
v(1)=0,\hspace{1cm}v(x^{-1})=-v(x),\hspace{1cm}(-x)=v(x),\\
v(x)<v(y)\Rightarrow v(x+y)=v(x)
\end{gather*}

\begin{definition}[]
Let \(v:K^\times\to\Gamma\) be a valuation on a field. We set
\begin{enumerate}
\item \(\calo_v:=\{x\in K:v(x)\ge 0\}\)
\item \(\fm_v:=\{x\in K:v(x)>0\}\)
\item \(\bk_v:=\calo_v/\fm_v\).
\end{enumerate}
\end{definition}

For all \(x,y\in\calo_v\) we have
\begin{gather*}
v(x\pm y)\ge\min\{v(x),v(\pm y)\}\ge 0\\
v(xy)=v(x)+v(y)\ge 0
\end{gather*}
Hence \(x\pm y,xy\in\calo\). From \(v(x^{-1})=-v(x)\), we deduce that \(x\) is a unit in \(\calo_v\) iff \(v(x)=0\) and for
every \(x\in K\), either \(x\) or \(x^{-1}\) or both lie in \(\calo_v\). A subring \(\calo\) of \(K\)
satisfying
\begin{equation*}
x\in\calo \quad\text{ or }\quad x^{-1}\in\calo
\end{equation*}
for all \(x\in K^\times\) is called a \textbf{valuation ring} of \(K\). Thus \(\calo_v\)  is a valuation ring.
Moreover, \(\fm_v\) is an ideal of \(\calo_v\).
Since \(\fm_v\) consists exactly of the non-units of \(\calo_v\), \(\fm_v\) is a
maximal ideal, and in fact the only maximal ideal of \(\calo_v\). Thus \(\calo_v\) is a local ring(ring
with only one maximal ideal) and \(\bk_v\) is a field, called the \textbf{residue class field} of \(v\). The
residue class of \(a\in\calo_v\) is denoted
by \(\bara\). Note that \(v\) is trivial iff \(\calo_v=K\) iff \(\bk_v=K\). The group \(v(K^\times)\)
will be called the \textbf{value group} of \(v\).

\begin{proposition}[]
Let \(\calo\subseteq K\) be a valuation ring of \(K\). Then there exists a valuation \(v\) on \(K\) s.t. \(\calo=\calo_v\).
\end{proposition}

\begin{proof}
Denote by \(\calo^\times\) the group of units of \(\calo\). The group \(\Gamma=K^\times/\calo^\times\) is an abelian group and
we can define a binary relation on \(\Gamma\) by
\begin{equation*}
x\calo^\times\le y\calo^\times\Leftrightarrow\frac{y}{x}\in\calo
\end{equation*}
We can check that \(\Gamma\) is an ordered abelian group. The valuation is defined by
\begin{equation*}
v(x)=x\calo^\times\in\Gamma
\end{equation*}
for \(x\in K^\times\), and \(v(0)=\infty\). If \(v(x)\le v(y)\), then \(y/x\in\calo\). Therefore \((x+y)/x=1+y/x\in\calo\)
and \(v(x+y)\ge v(x)=\min\{v(x),v(y)\}\). Now
\begin{equation*}
\calo_v=\{x\in K\mid v(x)\ge 0\}=\{x\in K\mid x\in\calo\}=\calo
\end{equation*}
\end{proof}

\begin{examplle}[]
Consider \(K=\Q\), \(v=v_p\), then
\begin{align*}
\calo_{v_p}&=\{\frac{a}{b}\mid a,b\in\Z,b\text{ is not divisible by }p\}\\
\fm_{v_p}&=\{\frac{pa}{b}\mid a,b\in\Z,b\text{ is not divisible by }p\}
\end{align*}
\(\calo_{v_p}\) is the localization \(\Z_{(p)}=(\Z-(p))^{-1}\Z)\) of the ring \(\Z\) at the prime ideal \((p)=p\Z\),
and \(\fm_{v_p}\) is \(p\Z_{(p)}\). Thus the residue class field \(\bk_{v_p}\) is isomorphic to
the finite field \(\F_p\).
\end{examplle}

\begin{examplle}[]
Consider \(K=F((T))=\{\sum_{n=m}^\infty a_nT^n\mid m\in\Z,a_n\in F\}\), field of formal Laurent series with
valuation \(v(f)=m\) where \(f=\sum_{n=m}^\infty a_nT^n\) and \(a_m\neq 0\), then \(\calo_{v}=F[[T]]\), \(\fm_v\) is all
series \(\sum_{n=m}^\infty a_nT^n\) where \(m>0\) and the residue field \(\bk_v\) is \(F\).
\end{examplle}
