course/ModelTheoryReadingGroup/BasicValuationTheory.org
* Hensel's Lemma
    #+ATTR_LATEX: :options []
    #+BEGIN_definition
    A local domain \(A\) with maximal ideal \(\fm\) is *henselian* if whenever \(f(x)\in A[X]\) and there
    is \(a\in A\) s.t. \(f(a)\in\fm\) and \(f'(a)\notin\fm\), then there is \(\alpha\in A\) s.t. \(f(\alpha)=0\)
    and \(\alpha-a\in\fm\).

    A *valued field* is a pair \((K,\calo)\) where \(K\) is a field and \(A\) is a valuation ring. A
    valued field is *henselian* if its valuation ring is henselian.
    #+END_definition

    #+BEGIN_remark
    A ring is local iff all non-units form an ideal, therefore henselianity is a first-order property.
    #+END_remark

    #+ATTR_LATEX: :options [Hensel's Lemma]
    #+BEGIN_theorem
    Suppose \(K\) is a complete field with non-archimedean absolute value \(\abs{\;}\) and valuation
    ring \(\calo=\{x\in K:\abs{x}\le 1\}\). Then \(\calo\) is henselian
    #+END_theorem

    #+BEGIN_proof
    Suppose \(a\in\calo_v\), \(\abs{f(a)}=\epsilon<1\) and \(\abs{f'(a)}=1\). We think of \(a\) as our first
    approximation to a zero of \(f\) and use Newton's method to find a better approximation.

    Let \(\delta=\frac{-f(a)}{f'(a)}\). Note that \(\abs{\delta}=\abs{\frac{f(a)}{f'(a)}}=\epsilon\). Consider the
    Taylor expansion
    \begin{equation*}
    f(a+x)=f(a)+f'(a)x+\text{terms of degree at least 2 in \(x\)}
    \end{equation*}
    Thus
    \begin{equation*}
    f(a+\delta)=f(a)+f'(a)\frac{-f(a)}{f'(a)}+\text{terms of degree at least 2 in \(\delta\)}
    \end{equation*}
    Thus \(\abs{f(a+\delta)}\le\epsilon^2\). Similarly
    \begin{equation*}
    f'(a+\delta)=f'(a)+\text{terms of degree at least 2 in \(\delta\)}
    \end{equation*}
    and \(\abs{f'(a+\delta)}=\abs{f'(a)}=1\).

    Thus starting with an approximation where \(\abs{f(a)}=\epsilon<1\) and \(\abs{f'(a)}=1\), we get a
    better approximation \(b\) where \(\abs{f(b)}\le\epsilon^2\) and \(\abs{f'(b)}=1\). We now iterate this
    procedure to build \(a=a_0,a_1,a_2,\dots\) where
    \begin{equation*}
    a_{n+1}=a_n-\frac{a_n}{f'(a_n)}
    \end{equation*}
    It follows, by induction, that for all \(n\):
    1. \(\abs{a_{n+1}-a_n}\le\epsilon^{2^{n+1}}\)
    2. \(\abs{f(a_n)}\le\epsilon^{2^n}\)
    3. \(\abs{f'(a_n)}=1\)
    Thus \((a_n)_{n\in\N}\) is a Cauchy sequence and converges to \alpha, \(\abs{\alpha-a}\le\epsilon\), and \(f(\alpha)=\lim_{n\to\infty}f(a_n)=0\)
    #+END_proof

    Therefore we have henselian field \((\Q_p,\Z_p)\) and \((F((T)),F[[T]])\).

    #+ATTR_LATEX: :options [Chevalley]
    #+BEGIN_fact
    For a field \(K\), let \(A\subseteq K\) be a subring and let \(P\subseteq A\) be a prime ideal of \(A\). Then
    there exists a valuation ring \(\calo\) of \(K\) s.t.
    \begin{equation*}
    R\subseteq\calo \quad\text{ and }\quad M\cap R=P
    \end{equation*}
    where \(M\) is the maximal ideal of \(\calo\).
    #+END_fact

    #+ATTR_LATEX: :options []
    #+BEGIN_lemma
    Let \(K_2/K_1\) be a field extension and let \(\calo_1\subseteq K_1\) be a valuation ring. Then there is a
    valuation ring \(\calo_2\subseteq K_2\) with \(\calo_2\cap K_1=\calo_1\).
    #+END_lemma

    #+BEGIN_proof
    Since \(\calo_1\) is a subring of \(K_2\), according to Chevalley's Theorem there exists a valuation
    ring \(\calo_2\) of \(K_2\) with \(\calo_1\subseteq\calo_2\) and \(\fm_2\cap\calo_1=\fm_1\) for maximal ideals. Since \(\calo_2\cap K_1\)
    and \(\calo_1\) are valuation rings with the same maximal ideal they must coincide.
    #+END_proof


    #+ATTR_LATEX: :options []
    #+BEGIN_fact
    Let \((K,\calo)\) be a valued field. T.F.A.E.:
    1. \((K,\calo)\) is henselian.
    2. For any separable extension \(L/K\) there is a unique extension of \(\calo\) to a
       valuation ring of \(L\).
    3. For any algebraic extension \(L/K\) there is a unique extension of \(\calo\) to a valuation ring
       of \(L\).
    #+END_fact

* Hahn Series
    For each group \Gamma and field \(k\), there is a field \(K=k((t^\Gamma))\) with valuation \(v\) having
    \Gamma as the value group and \(k\) as the residue field.
    #+ATTR_LATEX: :options []
    #+BEGIN_lemma
    Let \(A,B\subseteq\Gamma\) be well-ordered (by the ordering of \Gamma). Then \(A\cup B\) is well-ordered, the
    set \(A+B:=\{\alpha+\beta:\alpha\in A,\beta\in B\}\) is well-ordered, and for each \(\gamma\in\Gamma\) there are only finitely
    many \((\alpha,\beta)\in A\times B\)  s.t. \(\alpha+\beta=\gamma\).
    #+END_lemma

    #+BEGIN_proof
    Suppose \((a_0,b_0),(a_1,b_1),\dots\) are distinct s.t. \(a_i+b_i>a_j+b_j\) for \(i<j\). Then we can
    find a strictly monotone subsequence of the \(a_i\). Since \(A\) is well-ordered, the sequence
    cannot be decreasing. But then there is a strictly decreasing subsequence of \(b_i\).
    #+END_proof

    #+ATTR_LATEX: :options [Neumann's Lemma]
    #+BEGIN_lemma
    Let \(A\subseteq\Gamma^{>0}\) be well-ordered. Then
    \begin{equation*}
    [A]:=\{\alpha_1+\dots+\alpha_n:\alpha_1,\dots,\alpha_n\in A\}\hspace{2cm}(\text{allowing }n=0)
    \end{equation*}
    is also well-ordered, and for each \(\gamma\in[A]\) there are only finitely many
    tuples \((n,\alpha_1,\dots,\alpha_n)\) with \(\alpha_1,\dots,\alpha_n\in A\) s.t. \(\gamma=\alpha_1+\dots+\alpha_n\)
    #+END_lemma

    Define \(K=k((t^\Gamma))\) to be the set of all formal series \(f(t)=\sum_{\gamma\in\Gamma}a_\gamma t^\gamma\) with
    coefficients \(a_\gamma\in k\), s.t. the support of \(f\),
    \begin{equation*}
    \supp(f)    :=\{\gamma\in\Gamma:a_\gamma\neq 0\}
    \end{equation*}
    is a well-ordered subset of \Gamma.By the first lemma, we can define binary operations of addition
    and multiplication on \(k((t^\Gamma))\) as
    \begin{gather*}
    \sum a_\gamma t^\gamma+\sum b_\gamma t^\gamma=\sum(a_\gamma+b_\gamma)t^\gamma\\
    \left( \sum a_\gamma t^\gamma \right)\left( \sum b_\gamma t^\gamma \right)=
    \sum_\gamma\left( \sum_{\alpha+\beta=\gamma}a_\alpha b_\beta \right)t^\gamma
    \end{gather*}
    Define \(v:K\setminus\{0\}\to\Gamma\) by
    \begin{equation*}
    v(\sum a_\gamma t^\gamma):=\min\{\gamma:a_\gamma\neq 0\}
    \end{equation*}
    Then \(v\) is a valuation on \(K\). If \(v(f)>0\), then by the second lemma \(\sum_{n=0}^\infty f^n\)
    makes sense as an element of \(K\): for any \(\gamma\in\Gamma\) there are only finitely many \(n\) s.t. the
    coefficients of \(t^\gamma\) in \(f^n\) is not zero. Then
    \begin{equation*}
    (1-f)\sum_{n=0}^\infty f^n=1
    \end{equation*}
    Now for any \(g\in K\setminus\{0\}\), \(g=ct^\gamma(1-f)\), with \(c\in k^\times\) and \(v(f)>0\).
    Then \(g^{-1}=c^{-1}t^{-\gamma}\sum_nf^n\).

    For \(f=\sum a_\gamma t^\gamma\in K\), call \(a_0\) the constant term of \(f\). The map sending sending \(f\) to
    its constant term sends \(\calo_v\) onto \(k\), and this is a ring homomorphism. Its kernel
    is \(\fm_v\). Therefore \(\calo_v/\fm_v\cong k\).

    We call \(K\) the *Hahn field*.

    #+ATTR_LATEX: :options []
    #+BEGIN_definition
    Let \(K\) be a valued field. We say that \(K\) is *spherically complete* if whenever \((I,<)\) is
    a linear order and \((B_i:i\in I)\) is a family of open balls s.t. \(B_i\supset B_j\) for all \(i<j\),
    then \(\bigcap_{i\in I}B_i\neq\emptyset\).
    #+END_definition

    #+ATTR_LATEX: :options []
    #+BEGIN_definition
    If \((K,v)\) is a valuation field extending \(L\) as a subfield, then \(K\) is an *immediate
    extension* if \(v(K)=v(L)\) and \(\bk_K=\bk_L\).
    #+END_definition


    #+ATTR_LATEX: :options []
    #+BEGIN_fact
    1. Hahn field is henselian.
    1. Hahn field is spherically complete.
    2. Hahn field has no proper immediate extensions.
    #+END_fact
